<?php

class Texts
{
    // user

    // buttons
    const
        BTN_MALE = "🙋‍♂️",
        BTN_FEMALE = "🙋‍♀",

        BTN_AGE_1 = "14-16",
        BTN_AGE_2 = "17-18",
        BTN_AGE_3 = "19-20",

        BTN_TEXT_MESSAGE = "Текстовое сообщение",
        BTN_AUDIO_MESSAGE = "Аудио-сообщение",

        BTN_LIKE = "👍",
        BTN_DISLIKE = "👎",

        BTN_ASK_AGAIN = "Задать ещё вопрос",

        BTN_LEAVE_REVIEW = "💬 Оставить отзыв",
        BTN_ABOUT = "ℹ️ О боте";

    // texts
    const
        TXT_START = "📣 Доброго времени суток!
Вас приветствует онлайн психолог-тератевт PsychoTeen
Прежде чем задать вопрос, выберите, пожалуйста, Ваш пол и возрастную категорию:",
        TXT_CHOOSE_AGE = "Выберите, пожалуйста, Вашу возрастную категорию:",
        TXT_CHOOSE_ANSWER_TYPE = "Выберите формат вопроса который для Вас удобнее:",
        TXT_ASK_QUESTION = "Пожалуйста, задайте ваш вопрос❗️
☑️ Вопрос должен быть сформулирован максимально корректно.
ℹ️ Опишите Вашу проблему/ситуацию как можно детальнее,  для более быстрой и качественной консультации.",
        TXT_ABOUT = "❗️КОНФИДЕНЦИАЛЬНО И БЕСПЛАТНО❗️
📢 Индивидуальная онлайн консультация квалифицированного психолога-терапевта для подростков в возрасте 13-19 лет в сфере отношений. 💕

PsychoTeen также предлагает специальные услуги для родителей и опекунов, которые хотят, чтобы их ребенок получил заслуженную помощь.

Цель PsychoTeen - помочь подросткам справиться с различными проблемами, такими как беспокойство, стресс, чувство собственного достоинства, депрессия, издевательства, расстройства пищевого поведения, отношения или гнев.",
        TXT_WAIT_ANSWER = "♻️Ваш вопрос принят. Первый освободившийся психолог-терапевт ознакомится с Вашей проблемой и вы получите ответ в ближайшее время (до 2х рабочих часов).",
        TXT_QUESTION_REJECTED_USER = "❌ Вопрос некорректный❌
ℹ️ Опишите ситуацию как можно детальнее, для более быстрой и качественной консультации.",
        TXT_ANSWER_READY_1 = "✅ Ваш ответ готов!\n\nВопрос:\n",
        TXT_ANSWER_READY_2 = "\n\nОтвет:\n",
        TXT_ASK_LATER = "Вы сможете задать следующий вопрос когда получите ответ на предыдущий.",
        TXT_RATE_ANSWER = "Пожалуйста, оцените качество обслуживания нашего психолога-терапевта:",
        TXT_AFTER_LIKE = "Благодарим вас за то, что воспользовались нашими услугами!",
        TXT_AFTER_DISLIKE = "В целях улучшения качества нашего обслуживания, просим Вас оставить Ваш отзыв ниже.",
        TXT_PLZ_WRITE_COMMENT = "Пожалуйста, напишите свой отзыв:",
        TXT_THANKS_FOR_COMMENT = "Благодарим за Ваш отзыв.";

    // admin

    // buttons
    const
        BTN_CANCEL = "❌ Отменить",
        BTN_ANSWER = "Ответить на вопросы",
        BTN_NOT_CORRECT_QUESTION = "Не корректый вопрос!",
        BTN_WRITE_ANSWER = "Начать писать ответ",
        BTN_BACK = "⬅️ ️Назад",
        BNT_STATISTICS = "Статистика";

    // texts

    const
        TXT_WELCOME = "Добро пожаловать в панель для администратора. Здесь вы можете отвечать на вопросы подписчиков.",
        TXT_NO_QUESTION = "Вопросов на данный момент нет.",
        TXT_CHOOSE_QUESTION = "Выберите вопрос:",
        TXT_QUESTION = "Вопрос:\n",
        TXT_WRITE_ANSWER = "Напишите ответ:",
        TXT_QUESTION_REJECTED = "Вопрос успешно отклонен.",
        TXT_MAIN_PAGE = "Главная страница",
        TXT_QUESTION_ANSWERED = "Ответ успешно отправлен.";
}